W6D5/w6d5-master/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all.to_a
---
SELECT "cats".* FROM "cats"

    def show
        @cat = Cat.find_by(id: params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]