W6D3/first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
            if params.has_key?(:user_id)
                artworks = Artwork.where({artist_id: params[:user_id]})
            else
                artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "le chat domestique"], ["image_url", "www.france.com"], ["artist_id", 13], ["created_at", "2019-10-31 15:54:21.530268"], ["updated_at", "2019-10-31 15:54:21.530268"]]
---
    def create
        artwork = Artwork.new(artwork_params)

        if artwork.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        artwork = Artwork.find(params[:id])

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]
---
    def destroy
        artwork = Artwork.find(params[:id])

        artwork.destroy