W6D3/first_routes/app/controllers/artwork_shares_controller.rb

    def index
        render json: ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def show
        artwork_share = ArtworkShare.find(params[:id])
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        artwork_share = ArtworkShare.new(artwork_share_params)

        if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 14], ["created_at", "2019-10-31 17:51:05.328169"], ["updated_at", "2019-10-31 17:51:05.328169"]]

    def destroy
        artwork_share = ArtworkShare.find(params[:id])

        artwork_share.destroy
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]