W6D3/first_routes/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            comments = Comment.where({user_id: params[:user_id]})
        elsif params.has_key?(:artwork_id)
            comments = Comment.where({artwork_id: params[:artwork_id]})
        else
            comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 23]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 12]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comment_params)

        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 24], ["artwork_id", 13], ["body", "@_@"], ["created_at", "2019-10-31 19:27:18.588899"], ["updated_at", "2019-10-31 19:27:18.588899"]]

    def show
        comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def destroy
        comment = Comment.find(params[:id])

        comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]