W6D3/first_routes/app/controllers/users_controller.rb

    def index
        if params.has_key?(:username)
            username = User.where({username: params[:username]})
            render json: username
        else
            render json: User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "David"]]
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)

        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Zeus"], ["email", "zeus@email.com"], ["created_at", "2019-10-30 20:14:31.067917"], ["updated_at", "2019-10-30 20:14:31.067917"]]

    def show
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

    def update
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "zeus@dogacademy.io"], ["updated_at", "2019-10-30 20:34:38.012647"], ["id", 5]]

    def destroy
        user = User.find(params[:id])

        user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]